node {
  name: "parallel_read/filenames/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
          dim {
            size: 128
          }
        }
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00000-of-00128"
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00001-of-00128"
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00002-of-00128"
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00003-of-00128"
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00004-of-00128"
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00005-of-00128"
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00006-of-00128"
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00007-of-00128"
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00008-of-00128"
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00009-of-00128"
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00010-of-00128"
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00011-of-00128"
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00012-of-00128"
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00013-of-00128"
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00014-of-00128"
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00015-of-00128"
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00016-of-00128"
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00017-of-00128"
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00018-of-00128"
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00019-of-00128"
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00020-of-00128"
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00021-of-00128"
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00022-of-00128"
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00023-of-00128"
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00024-of-00128"
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00025-of-00128"
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00026-of-00128"
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00027-of-00128"
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00028-of-00128"
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00029-of-00128"
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00030-of-00128"
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00031-of-00128"
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00032-of-00128"
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00033-of-00128"
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00034-of-00128"
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00035-of-00128"
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00036-of-00128"
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00037-of-00128"
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00038-of-00128"
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00039-of-00128"
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00040-of-00128"
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00041-of-00128"
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00042-of-00128"
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00043-of-00128"
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00044-of-00128"
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00045-of-00128"
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00046-of-00128"
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00047-of-00128"
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00048-of-00128"
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00049-of-00128"
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00050-of-00128"
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00051-of-00128"
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00052-of-00128"
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00053-of-00128"
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00054-of-00128"
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00055-of-00128"
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00056-of-00128"
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00057-of-00128"
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00058-of-00128"
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00059-of-00128"
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00060-of-00128"
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00061-of-00128"
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00062-of-00128"
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00063-of-00128"
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00064-of-00128"
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00065-of-00128"
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00066-of-00128"
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00067-of-00128"
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00068-of-00128"
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00069-of-00128"
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00070-of-00128"
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00071-of-00128"
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00072-of-00128"
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00073-of-00128"
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00074-of-00128"
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00075-of-00128"
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00076-of-00128"
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00077-of-00128"
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00078-of-00128"
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00079-of-00128"
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00080-of-00128"
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00081-of-00128"
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00082-of-00128"
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00083-of-00128"
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00084-of-00128"
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00085-of-00128"
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00086-of-00128"
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00087-of-00128"
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00088-of-00128"
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00089-of-00128"
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00090-of-00128"
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00091-of-00128"
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00092-of-00128"
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00093-of-00128"
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00094-of-00128"
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00095-of-00128"
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00096-of-00128"
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00097-of-00128"
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00098-of-00128"
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00099-of-00128"
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00100-of-00128"
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00101-of-00128"
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00102-of-00128"
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00103-of-00128"
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00104-of-00128"
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00105-of-00128"
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00106-of-00128"
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00107-of-00128"
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00108-of-00128"
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00109-of-00128"
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00110-of-00128"
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00111-of-00128"
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00112-of-00128"
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00113-of-00128"
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00114-of-00128"
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00115-of-00128"
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00116-of-00128"
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00117-of-00128"
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00118-of-00128"
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00119-of-00128"
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00120-of-00128"
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00121-of-00128"
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00122-of-00128"
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00123-of-00128"
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00124-of-00128"
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00125-of-00128"
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00126-of-00128"
        string_val: "/readahead/200M/placer/prod/home/distbelief/imagenet-tensorflow/imagenet-2012-tfrecord/validation-00127-of-00128"
      }
    }
  }
}
node {
  name: "parallel_read/filenames/Size"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 128
      }
    }
  }
}
node {
  name: "parallel_read/filenames/Greater/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "parallel_read/filenames/Greater"
  op: "Greater"
  input: "parallel_read/filenames/Size"
  input: "parallel_read/filenames/Greater/y"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "parallel_read/filenames/Assert/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "string_input_producer requires a non-null input tensor"
      }
    }
  }
}
node {
  name: "parallel_read/filenames/Assert/Assert/data_0"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "string_input_producer requires a non-null input tensor"
      }
    }
  }
}
node {
  name: "parallel_read/filenames/Assert/Assert"
  op: "Assert"
  input: "parallel_read/filenames/Greater"
  input: "parallel_read/filenames/Assert/Assert/data_0"
  attr {
    key: "T"
    value {
      list {
        type: DT_STRING
      }
    }
  }
  attr {
    key: "summarize"
    value {
      i: 3
    }
  }
}
node {
  name: "parallel_read/filenames/Identity"
  op: "Identity"
  input: "parallel_read/filenames/Const"
  input: "^parallel_read/filenames/Assert/Assert"
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
}
node {
  name: "parallel_read/filenames"
  op: "FIFOQueueV2"
  attr {
    key: "capacity"
    value {
      i: 32
    }
  }
  attr {
    key: "component_types"
    value {
      list {
        type: DT_STRING
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "parallel_read/filenames/filenames_EnqueueMany"
  op: "QueueEnqueueManyV2"
  input: "parallel_read/filenames"
  input: "parallel_read/filenames/Identity"
  attr {
    key: "Tcomponents"
    value {
      list {
        type: DT_STRING
      }
    }
  }
  attr {
    key: "timeout_ms"
    value {
      i: -1
    }
  }
}
node {
  name: "parallel_read/filenames/filenames_Close"
  op: "QueueCloseV2"
  input: "parallel_read/filenames"
  attr {
    key: "cancel_pending_enqueues"
    value {
      b: false
    }
  }
}
node {
  name: "parallel_read/filenames/filenames_Close_1"
  op: "QueueCloseV2"
  input: "parallel_read/filenames"
  attr {
    key: "cancel_pending_enqueues"
    value {
      b: true
    }
  }
}
node {
  name: "parallel_read/filenames/filenames_Size"
  op: "QueueSizeV2"
  input: "parallel_read/filenames"
}
node {
  name: "parallel_read/filenames/ToFloat"
  op: "Cast"
  input: "parallel_read/filenames/filenames_Size"
  attr {
    key: "DstT"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "SrcT"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "parallel_read/filenames/mul/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.03125
      }
    }
  }
}
node {
  name: "parallel_read/filenames/mul"
  op: "Mul"
  input: "parallel_read/filenames/ToFloat"
  input: "parallel_read/filenames/mul/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "parallel_read/filenames/fraction_of_32_full/tags"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "parallel_read/filenames/fraction_of_32_full"
      }
    }
  }
}
node {
  name: "parallel_read/filenames/fraction_of_32_full"
  op: "ScalarSummary"
  input: "parallel_read/filenames/fraction_of_32_full/tags"
  input: "parallel_read/filenames/mul"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "parallel_read/common_queue"
  op: "FIFOQueueV2"
  attr {
    key: "capacity"
    value {
      i: 256
    }
  }
  attr {
    key: "component_types"
    value {
      list {
        type: DT_STRING
        type: DT_STRING
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "shapes"
    value {
      list {
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "parallel_read/common_queue_Size"
  op: "QueueSizeV2"
  input: "parallel_read/common_queue"
}
node {
  name: "parallel_read/ToFloat"
  op: "Cast"
  input: "parallel_read/common_queue_Size"
  attr {
    key: "DstT"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "SrcT"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "parallel_read/mul/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.00390625
      }
    }
  }
}
node {
  name: "parallel_read/mul"
  op: "Mul"
  input: "parallel_read/ToFloat"
  input: "parallel_read/mul/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "parallel_read/fraction_of_256_full/tags"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "parallel_read/fraction_of_256_full"
      }
    }
  }
}
node {
  name: "parallel_read/fraction_of_256_full"
  op: "ScalarSummary"
  input: "parallel_read/fraction_of_256_full/tags"
  input: "parallel_read/mul"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "parallel_read/TFRecordReaderV2"
  op: "TFRecordReaderV2"
  attr {
    key: "compression_type"
    value {
      s: ""
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "parallel_read/ReaderReadV2"
  op: "ReaderReadV2"
  input: "parallel_read/TFRecordReaderV2"
  input: "parallel_read/filenames"
}
node {
  name: "parallel_read/common_queue_enqueue"
  op: "QueueEnqueueV2"
  input: "parallel_read/common_queue"
  input: "parallel_read/ReaderReadV2"
  input: "parallel_read/ReaderReadV2:1"
  attr {
    key: "Tcomponents"
    value {
      list {
        type: DT_STRING
        type: DT_STRING
      }
    }
  }
  attr {
    key: "timeout_ms"
    value {
      i: -1
    }
  }
}
node {
  name: "parallel_read/common_queue_Close"
  op: "QueueCloseV2"
  input: "parallel_read/common_queue"
  attr {
    key: "cancel_pending_enqueues"
    value {
      b: false
    }
  }
}
node {
  name: "parallel_read/common_queue_Close_1"
  op: "QueueCloseV2"
  input: "parallel_read/common_queue"
  attr {
    key: "cancel_pending_enqueues"
    value {
      b: true
    }
  }
}
node {
  name: "parallel_read/common_queue_Dequeue"
  op: "QueueDequeueV2"
  input: "parallel_read/common_queue"
  attr {
    key: "component_types"
    value {
      list {
        type: DT_STRING
        type: DT_STRING
      }
    }
  }
  attr {
    key: "timeout_ms"
    value {
      i: -1
    }
  }
}
node {
  name: "ParseSingleExample/key_image/class/label"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: -1
      }
    }
  }
}
node {
  name: "ParseSingleExample/Reshape/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "ParseSingleExample/Reshape"
  op: "Reshape"
  input: "ParseSingleExample/key_image/class/label"
  input: "ParseSingleExample/Reshape/shape"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "ParseSingleExample/key_image/class/text"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: ""
      }
    }
  }
}
node {
  name: "ParseSingleExample/Reshape_1/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "ParseSingleExample/Reshape_1"
  op: "Reshape"
  input: "ParseSingleExample/key_image/class/text"
  input: "ParseSingleExample/Reshape_1/shape"
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "ParseSingleExample/key_image/encoded"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: ""
      }
    }
  }
}
node {
  name: "ParseSingleExample/Reshape_2/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "ParseSingleExample/Reshape_2"
  op: "Reshape"
  input: "ParseSingleExample/key_image/encoded"
  input: "ParseSingleExample/Reshape_2/shape"
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "ParseSingleExample/key_image/format"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "jpeg"
      }
    }
  }
}
node {
  name: "ParseSingleExample/Reshape_3/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "ParseSingleExample/Reshape_3"
  op: "Reshape"
  input: "ParseSingleExample/key_image/format"
  input: "ParseSingleExample/Reshape_3/shape"
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "ParseSingleExample/ParseSingleExample"
  op: "ParseSingleExample"
  input: "parallel_read/common_queue_Dequeue:1"
  input: "ParseSingleExample/Reshape"
  input: "ParseSingleExample/Reshape_1"
  input: "ParseSingleExample/Reshape_2"
  input: "ParseSingleExample/Reshape_3"
  attr {
    key: "Tdense"
    value {
      list {
        type: DT_INT64
        type: DT_STRING
        type: DT_STRING
        type: DT_STRING
      }
    }
  }
  attr {
    key: "dense_keys"
    value {
      list {
        s: "image/class/label"
        s: "image/class/text"
        s: "image/encoded"
        s: "image/format"
      }
    }
  }
  attr {
    key: "dense_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
        shape {
        }
        shape {
        }
        shape {
        }
      }
    }
  }
  attr {
    key: "num_sparse"
    value {
      i: 5
    }
  }
  attr {
    key: "sparse_keys"
    value {
      list {
        s: "image/object/bbox/xmax"
        s: "image/object/bbox/xmin"
        s: "image/object/bbox/ymax"
        s: "image/object/bbox/ymin"
        s: "image/object/class/label"
      }
    }
  }
  attr {
    key: "sparse_types"
    value {
      list {
        type: DT_FLOAT
        type: DT_FLOAT
        type: DT_FLOAT
        type: DT_FLOAT
        type: DT_INT64
      }
    }
  }
}
node {
  name: "Reshape/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "Reshape"
  op: "Reshape"
  input: "ParseSingleExample/ParseSingleExample:15"
  input: "Reshape/shape"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "Reshape_1/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "Reshape_1"
  op: "Reshape"
  input: "ParseSingleExample/ParseSingleExample:16"
  input: "Reshape_1/shape"
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "Reshape_2/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "Reshape_2"
  op: "Reshape"
  input: "ParseSingleExample/ParseSingleExample:17"
  input: "Reshape_2/shape"
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "Reshape_3/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "Reshape_3"
  op: "Reshape"
  input: "ParseSingleExample/ParseSingleExample:18"
  input: "Reshape_3/shape"
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "Equal/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "raw"
      }
    }
  }
}
node {
  name: "Equal"
  op: "Equal"
  input: "Reshape_3"
  input: "Equal/y"
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
}
node {
  name: "Equal_1/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "RAW"
      }
    }
  }
}
node {
  name: "Equal_1"
  op: "Equal"
  input: "Reshape_3"
  input: "Equal_1/y"
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
}
node {
  name: "LogicalOr"
  op: "LogicalOr"
  input: "Equal"
  input: "Equal_1"
}
node {
  name: "case/preds_c"
  op: "Pack"
  input: "LogicalOr"
  attr {
    key: "N"
    value {
      i: 1
    }
  }
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "axis"
    value {
      i: 0
    }
  }
}
node {
  name: "case/Cast"
  op: "Cast"
  input: "case/preds_c"
  attr {
    key: "DstT"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "SrcT"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "case/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "case/num_true_conds"
  op: "Sum"
  input: "case/Cast"
  input: "case/Const"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "case/n_true_conds"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "case/LessEqual"
  op: "LessEqual"
  input: "case/num_true_conds"
  input: "case/n_true_conds"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "case/Assert/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "Input error: exclusive=True: more than 1 conditions (LogicalOr:0) evaluated as True:"
      }
    }
  }
}
node {
  name: "case/Assert/AssertGuard/Switch"
  op: "Switch"
  input: "case/LessEqual"
  input: "case/LessEqual"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "case/Assert/AssertGuard/switch_t"
  op: "Identity"
  input: "case/Assert/AssertGuard/Switch:1"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "case/Assert/AssertGuard/switch_f"
  op: "Identity"
  input: "case/Assert/AssertGuard/Switch"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "case/Assert/AssertGuard/pred_id"
  op: "Identity"
  input: "case/LessEqual"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "case/Assert/AssertGuard/NoOp"
  op: "NoOp"
  input: "^case/Assert/AssertGuard/switch_t"
}
node {
  name: "case/Assert/AssertGuard/control_dependency"
  op: "Identity"
  input: "case/Assert/AssertGuard/switch_t"
  input: "^case/Assert/AssertGuard/NoOp"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@case/Assert/AssertGuard/switch_t"
      }
    }
  }
}
node {
  name: "case/Assert/AssertGuard/Assert/data_0"
  op: "Const"
  input: "^case/Assert/AssertGuard/switch_f"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "Input error: exclusive=True: more than 1 conditions (LogicalOr:0) evaluated as True:"
      }
    }
  }
}
node {
  name: "case/Assert/AssertGuard/Assert"
  op: "Assert"
  input: "case/Assert/AssertGuard/Assert/Switch"
  input: "case/Assert/AssertGuard/Assert/data_0"
  input: "case/Assert/AssertGuard/Assert/Switch_1"
  attr {
    key: "T"
    value {
      list {
        type: DT_STRING
        type: DT_BOOL
      }
    }
  }
  attr {
    key: "summarize"
    value {
      i: 1
    }
  }
}
node {
  name: "case/Assert/AssertGuard/Assert/Switch"
  op: "Switch"
  input: "case/LessEqual"
  input: "case/Assert/AssertGuard/pred_id"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@case/LessEqual"
      }
    }
  }
}
node {
  name: "case/Assert/AssertGuard/Assert/Switch_1"
  op: "Switch"
  input: "case/preds_c"
  input: "case/Assert/AssertGuard/pred_id"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@case/preds_c"
      }
    }
  }
}
node {
  name: "case/Assert/AssertGuard/control_dependency_1"
  op: "Identity"
  input: "case/Assert/AssertGuard/switch_f"
  input: "^case/Assert/AssertGuard/Assert"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@case/Assert/AssertGuard/switch_f"
      }
    }
  }
}
node {
  name: "case/Assert/AssertGuard/Merge"
  op: "Merge"
  input: "case/Assert/AssertGuard/control_dependency_1"
  input: "case/Assert/AssertGuard/control_dependency"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "case/cond/Switch"
  op: "Switch"
  input: "LogicalOr"
  input: "LogicalOr"
  input: "^case/Assert/AssertGuard/Merge"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "case/cond/switch_t"
  op: "Identity"
  input: "case/cond/Switch:1"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "case/cond/switch_f"
  op: "Identity"
  input: "case/cond/Switch"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "case/cond/pred_id"
  op: "Identity"
  input: "LogicalOr"
  input: "^case/Assert/AssertGuard/Merge"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "case/cond/DecodeRaw"
  op: "DecodeRaw"
  input: "case/cond/DecodeRaw/Switch:1"
  input: "^case/Assert/AssertGuard/Merge"
  attr {
    key: "little_endian"
    value {
      b: true
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_UINT8
    }
  }
}
node {
  name: "case/cond/DecodeRaw/Switch"
  op: "Switch"
  input: "Reshape_2"
  input: "case/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Reshape_2"
      }
    }
  }
}
node {
  name: "case/cond/is_jpeg/Substr/pos"
  op: "Const"
  input: "^case/Assert/AssertGuard/Merge"
  input: "^case/cond/switch_f"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "case/cond/is_jpeg/Substr/len"
  op: "Const"
  input: "^case/Assert/AssertGuard/Merge"
  input: "^case/cond/switch_f"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 3
      }
    }
  }
}
node {
  name: "case/cond/is_jpeg/Substr"
  op: "Substr"
  input: "case/cond/is_jpeg/Substr/Switch"
  input: "case/cond/is_jpeg/Substr/pos"
  input: "case/cond/is_jpeg/Substr/len"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "case/cond/is_jpeg/Substr/Switch"
  op: "Switch"
  input: "Reshape_2"
  input: "case/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Reshape_2"
      }
    }
  }
}
node {
  name: "case/cond/is_jpeg/Equal/y"
  op: "Const"
  input: "^case/Assert/AssertGuard/Merge"
  input: "^case/cond/switch_f"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "\377\330\377"
      }
    }
  }
}
node {
  name: "case/cond/is_jpeg/Equal"
  op: "Equal"
  input: "case/cond/is_jpeg/Substr"
  input: "case/cond/is_jpeg/Equal/y"
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
}
node {
  name: "case/cond/cond_jpeg/Switch"
  op: "Switch"
  input: "case/cond/is_jpeg/Equal"
  input: "case/cond/is_jpeg/Equal"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "case/cond/cond_jpeg/switch_t"
  op: "Identity"
  input: "case/cond/cond_jpeg/Switch:1"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "case/cond/cond_jpeg/switch_f"
  op: "Identity"
  input: "case/cond/cond_jpeg/Switch"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "case/cond/cond_jpeg/pred_id"
  op: "Identity"
  input: "case/cond/is_jpeg/Equal"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "case/cond/cond_jpeg/DecodeJpeg"
  op: "DecodeJpeg"
  input: "case/cond/cond_jpeg/DecodeJpeg/Switch:1"
  input: "^case/Assert/AssertGuard/Merge"
  attr {
    key: "acceptable_fraction"
    value {
      f: 1.0
    }
  }
  attr {
    key: "channels"
    value {
      i: 3
    }
  }
  attr {
    key: "dct_method"
    value {
      s: ""
    }
  }
  attr {
    key: "fancy_upscaling"
    value {
      b: true
    }
  }
  attr {
    key: "ratio"
    value {
      i: 1
    }
  }
  attr {
    key: "try_recover_truncated"
    value {
      b: false
    }
  }
}
node {
  name: "case/cond/cond_jpeg/DecodeJpeg/Switch"
  op: "Switch"
  input: "case/cond/is_jpeg/Substr/Switch"
  input: "case/cond/cond_jpeg/pred_id"
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Reshape_2"
      }
    }
  }
}
node {
  name: "case/cond/cond_jpeg/decode_image/Substr/pos"
  op: "Const"
  input: "^case/Assert/AssertGuard/Merge"
  input: "^case/cond/cond_jpeg/switch_f"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "case/cond/cond_jpeg/decode_image/Substr/len"
  op: "Const"
  input: "^case/Assert/AssertGuard/Merge"
  input: "^case/cond/cond_jpeg/switch_f"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 3
      }
    }
  }
}
node {
  name: "case/cond/cond_jpeg/decode_image/Substr"
  op: "Substr"
  input: "case/cond/cond_jpeg/decode_image/Substr/Switch"
  input: "case/cond/cond_jpeg/decode_image/Substr/pos"
  input: "case/cond/cond_jpeg/decode_image/Substr/len"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "case/cond/cond_jpeg/decode_image/Substr/Switch"
  op: "Switch"
  input: "case/cond/is_jpeg/Substr/Switch"
  input: "case/cond/cond_jpeg/pred_id"
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Reshape_2"
      }
    }
  }
}
node {
  name: "case/cond/cond_jpeg/decode_image/is_jpeg/Substr/pos"
  op: "Const"
  input: "^case/Assert/AssertGuard/Merge"
  input: "^case/cond/cond_jpeg/switch_f"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "case/cond/cond_jpeg/decode_image/is_jpeg/Substr/len"
  op: "Const"
  input: "^case/Assert/AssertGuard/Merge"
  input: "^case/cond/cond_jpeg/switch_f"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 3
      }
    }
  }
}
node {
  name: "case/cond/cond_jpeg/decode_image/is_jpeg/Substr"
  op: "Substr"
  input: "case/cond/cond_jpeg/decode_image/Substr/Switch"
  input: "case/cond/cond_jpeg/decode_image/is_jpeg/Substr/pos"
  input: "case/cond/cond_jpeg/decode_image/is_jpeg/Substr/len"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "case/cond/cond_jpeg/decode_image/is_jpeg/Equal/y"
  op: "Const"
  input: "^case/Assert/AssertGuard/Merge"
  input: "^case/cond/cond_jpeg/switch_f"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "\377\330\377"
      }
    }
  }
}
node {
  name: "case/cond/cond_jpeg/decode_image/is_jpeg/Equal"
  op: "Equal"
  input: "case/cond/cond_jpeg/decode_image/is_jpeg/Substr"
  input: "case/cond/cond_jpeg/decode_image/is_jpeg/Equal/y"
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
}
node {
  name: "case/cond/cond_jpeg/decode_image/cond_jpeg/Switch"
  op: "Switch"
  input: "case/cond/cond_jpeg/decode_image/is_jpeg/Equal"
  input: "case/cond/cond_jpeg/decode_image/is_jpeg/Equal"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "case/cond/cond_jpeg/decode_image/cond_jpeg/switch_t"
  op: "Identity"
  input: "case/cond/cond_jpeg/decode_image/cond_jpeg/Switch:1"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "case/cond/cond_jpeg/decode_image/cond_jpeg/switch_f"
  op: "Identity"
  input: "case/cond/cond_jpeg/decode_image/cond_jpeg/Switch"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "case/cond/cond_jpeg/decode_image/cond_jpeg/pred_id"
  op: "Identity"
  input: "case/cond/cond_jpeg/decode_image/is_jpeg/Equal"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "case/cond/cond_jpeg/decode_image/cond_jpeg/check_jpeg_channels/x"
  op: "Const"
  input: "^case/Assert/AssertGuard/Merge"
  input: "^case/cond/cond_jpeg/decode_image/cond_jpeg/switch_t"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 3
      }
    }
  }
}
node {
  name: "case/cond/cond_jpeg/decode_image/cond_jpeg/check_jpeg_channels/y"
  op: "Const"
  input: "^case/Assert/AssertGuard/Merge"
  input: "^case/cond/cond_jpeg/decode_image/cond_jpeg/switch_t"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 4
      }
    }
  }
}
node {
  name: "case/cond/cond_jpeg/decode_image/cond_jpeg/check_jpeg_channels"
  op: "NotEqual"
  input: "case/cond/cond_jpeg/decode_image/cond_jpeg/check_jpeg_channels/x"
  input: "case/cond/cond_jpeg/decode_image/cond_jpeg/check_jpeg_channels/y"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "case/cond/cond_jpeg/decode_image/cond_jpeg/Assert/Const"
  op: "Const"
  input: "^case/Assert/AssertGuard/Merge"
  input: "^case/cond/cond_jpeg/decode_image/cond_jpeg/switch_t"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "Channels must be in (None, 0, 1, 3) when decoding JPEG images"
      }
    }
  }
}
node {
  name: "case/cond/cond_jpeg/decode_image/cond_jpeg/Assert/Assert/data_0"
  op: "Const"
  input: "^case/Assert/AssertGuard/Merge"
  input: "^case/cond/cond_jpeg/decode_image/cond_jpeg/switch_t"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "Channels must be in (None, 0, 1, 3) when decoding JPEG images"
      }
    }
  }
}
node {
  name: "case/cond/cond_jpeg/decode_image/cond_jpeg/Assert/Assert"
  op: "Assert"
  input: "case/cond/cond_jpeg/decode_image/cond_jpeg/check_jpeg_channels"
  input: "case/cond/cond_jpeg/decode_image/cond_jpeg/Assert/Assert/data_0"
  attr {
    key: "T"
    value {
      list {
        type: DT_STRING
      }
    }
  }
  attr {
    key: "summarize"
    value {
      i: 3
    }
  }
}
node {
  name: "case/cond/cond_jpeg/decode_image/cond_jpeg/DecodeJpeg"
  op: "DecodeJpeg"
  input: "case/cond/cond_jpeg/decode_image/cond_jpeg/DecodeJpeg/Switch:1"
